; domain
(define (domain zeno-travel)
(:requirements :typing)
(:types aircraft person - locatable
	locatable city flevel - object)

(:predicates (at ?x - locatable ?c - city)
             (in ?p - person ?a - aircraft)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?o1 - person ?o2 - aircraft ?o3 - city)
 :precondition (and (at ?o1 ?o3)
                    (at ?o2 ?o3))
 :effect (and (not (at ?o1 ?o3))
              (in ?o1 ?o2)))

(:action debark
 :parameters (?o1 - person ?o2 - aircraft ?o3 - city)
 :precondition (and (in ?o1 ?o2)
                    (at ?o2 ?o3))
 :effect (and (not (in ?o1 ?o2))
              (at ?o1 ?o3)))


(:action fly 
 :parameters (?o1 - aircraft ?o2 - city ?o3 - city ?o4 - flevel ?o5 - flevel)
 :precondition (and (at ?o1 ?o2)
                 (fuel-level ?o1 ?o4)
		 (next ?o5 ?o4))
 :effect (and (not (at ?o1 ?o2))
              (at ?o1 ?o3)
              (not (fuel-level ?o1 ?o4))
              (fuel-level ?o1 ?o5)))
                                  
(:action zoom
 :parameters (?o1 - aircraft ?o2 - city ?o3 - city ?o4 - flevel ?o5 - flevel ?o6 - flevel)
 :precondition (and (at ?o1 ?o2)
                    (fuel-level ?o1 ?o4)
		    (next ?o5 ?o4)
		    (next ?o6 ?o5))
 :effect (and (not (at ?o1 ?o2))
              (at ?o1 ?o3)
              (not (fuel-level ?o1 ?o4))
              (fuel-level ?o1 ?o6)))


(:action refuel
 :parameters (?o1 - aircraft ?o2 - city ?o3 - flevel ?o4 - flevel)
 :precondition (and (fuel-level ?o1 ?o3)
                    (next ?o3 ?o4)
                    (at ?o1 ?o2))
 :effect (and (fuel-level ?o1 ?o4)
 	      (not (fuel-level ?o1 ?o3))))
)

; problem
(define (problem ztravel-2-4)
  (:domain zeno-travel)
  (:objects plane1 -  aircraft plane2 -  aircraft person1 -  person person2 -  person person4 -  person person3 -  person city0 -  city city1 -  city city2 -  city city3 -  city fl0 -  flevel fl1 -  flevel fl2 -  flevel fl3 -  flevel fl4 -  flevel fl5 -  flevel fl6 -  flevel )
  (:init (next fl5 fl6) (next fl3 fl4) (next fl0 fl1) (at person2 city0) (next fl1 fl2) (at person3 city0) (next fl4 fl5) (next fl2 fl3) (in person4 plane1) (at plane1 city3) (at person1 city2) (fuel-level plane1 fl4) (at plane2 city0) (fuel-level plane2 fl1) )
  (:goal (and (next fl5 fl6)(next fl3 fl4)(next fl0 fl1)(next fl1 fl2)(next fl4 fl5)(next fl2 fl3)(in person4 plane1)(at plane1 city3)(at person1 city2)(in person3 plane2)(fuel-level plane1 fl5)(at plane2 city3)(fuel-level plane2 fl0)(at person2 city3)(not (in person1 plane1))(not (in person1 plane2))(not (in person2 plane1))(not (in person2 plane2))(not (in person3 plane1))(not (in person4 plane2))(not (fuel-level plane1 fl0))(not (fuel-level plane1 fl1))(not (fuel-level plane1 fl2))(not (fuel-level plane1 fl3))(not (fuel-level plane1 fl4))(not (fuel-level plane1 fl6))(not (fuel-level plane2 fl1))(not (fuel-level plane2 fl2))(not (fuel-level plane2 fl3))(not (fuel-level plane2 fl4))(not (fuel-level plane2 fl5))(not (fuel-level plane2 fl6))(not (next fl0 fl0))(not (next fl0 fl2))(not (next fl0 fl3))(not (next fl0 fl4))(not (next fl0 fl5))(not (next fl0 fl6))(not (next fl1 fl0))(not (next fl1 fl1))(not (next fl1 fl3))(not (next fl1 fl4))(not (next fl1 fl5))(not (next fl1 fl6))(not (next fl2 fl0))(not (next fl2 fl1))(not (next fl2 fl2))(not (next fl2 fl4))(not (next fl2 fl5))(not (next fl2 fl6))(not (next fl3 fl0))(not (next fl3 fl1))(not (next fl3 fl2))(not (next fl3 fl3))(not (next fl3 fl5))(not (next fl3 fl6))(not (next fl4 fl0))(not (next fl4 fl1))(not (next fl4 fl2))(not (next fl4 fl3))(not (next fl4 fl4))(not (next fl4 fl6))(not (next fl5 fl0))(not (next fl5 fl1))(not (next fl5 fl2))(not (next fl5 fl3))(not (next fl5 fl4))(not (next fl5 fl5))(not (next fl6 fl0))(not (next fl6 fl1))(not (next fl6 fl2))(not (next fl6 fl3))(not (next fl6 fl4))(not (next fl6 fl5))(not (next fl6 fl6)))))

; plan
1. (board person2 plane2 city0)
   deleted: (at person2 city0)
   added: (in person2 plane2)
   goals met: 67 of 75
2. (board person3 plane2 city0)
   deleted: (at person3 city0)
   added: (in person3 plane2)
   goals met: 68 of 75
3. (refuel plane1 city3 fl4 fl5)
   deleted: (fuel-level plane1 fl4)
   added: (fuel-level plane1 fl5)
   goals met: 70 of 75
4. (fly plane2 city0 city3 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 73 of 75
5. (debark person2 plane2 city3)
   deleted: (in person2 plane2)
   added: (at person2 city3)
   goals met: 75 of 75
